; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v6 ?v1)
             (pred_12 ?v13 ?v5)
             (pred_5 ?v6 ?v5)
             (pred_1 ?v7 ?v6 )
	     (pred_8 ?v6)
             (pred_10 ?v10)
             (pred_3 ?v13)
             (pred_11 ?v5)
             (pred_9 ?v6)
             (pred_6 ?v13)
             (pred_2 ?v6)
             (pred_4 ))



(:action op_3
:parameters (?v3 ?v4 ?v11 ?v2)
:precondition (and (pred_10 ?v3) (pred_10 ?v4) (pred_3 ?v11) (pred_11 ?v2)
          (pred_7 ?v3 ?v4) (pred_12 ?v11 ?v2)
                   (pred_5 ?v4 ?v2) (pred_8 ?v3) 
                   (pred_9 ?v4) (pred_6 ?v11))
:effect (and  (pred_2 ?v4) (not (pred_9 ?v4))))


(:action op_2
:parameters (?v3 ?v12)
:precondition (and (pred_10 ?v3) (pred_10 ?v12)
               (pred_8 ?v3) (pred_7 ?v3 ?v12) (pred_2 ?v12))
:effect (and (pred_8 ?v12) (not (pred_8 ?v3))))

(:action op_1
:parameters (?v3 ?v11)
:precondition (and (pred_10 ?v3) (pred_3 ?v11) 
                  (pred_8 ?v3) (pred_1 ?v11 ?v3) (pred_4 ))
:effect (and (pred_6 ?v11)
   (not (pred_1 ?v11 ?v3)) (not (pred_4 ))))


(:action op_5
:parameters (?v3 ?v8 ?v9)
:precondition (and (pred_10 ?v3) (pred_3 ?v8) (pred_3 ?v9)
                  (pred_8 ?v3) (pred_6 ?v9) (pred_1 ?v8 ?v3))
:effect (and (pred_6 ?v8) (pred_1 ?v9 ?v3)
        (not (pred_6 ?v9)) (not (pred_1 ?v8 ?v3))))

(:action op_4
:parameters (?v3 ?v11)
:precondition (and (pred_10 ?v3) (pred_3 ?v11) 
                  (pred_8 ?v3) (pred_6 ?v11))
:effect (and (pred_4 ) (pred_1 ?v11 ?v3) (not (pred_6 ?v11)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_02 obj_07 obj_09 obj_12 obj_13 obj_11 obj_18 obj_06 obj_20 obj_04 obj_03 obj_10 obj_17 obj_16 obj_14 obj_08
    obj_15 obj_05
    obj_19 obj_01
    )

    (:init
       (pred_4)

       (pred_10 obj_02)
       (pred_10 obj_07)
       (pred_10 obj_09)
       (pred_10 obj_12)
       (pred_10 obj_13)
       (pred_10 obj_11)
       (pred_10 obj_18)
       (pred_10 obj_06)
       (pred_10 obj_20)
       (pred_10 obj_04)
       (pred_10 obj_03)
       (pred_10 obj_10)
       (pred_10 obj_17)
       (pred_10 obj_16)
       (pred_10 obj_14)
       (pred_10 obj_08)
       (pred_11 obj_15)
       (pred_11 obj_05)
       (pred_3 obj_19)
       (pred_3 obj_01)

       (pred_7 obj_02 obj_13)
       (pred_7 obj_02 obj_07)
       (pred_7 obj_07 obj_11)
       (pred_7 obj_07 obj_09)
       (pred_7 obj_07 obj_02)
       (pred_7 obj_09 obj_18)
       (pred_7 obj_09 obj_12)
       (pred_7 obj_09 obj_07)
       (pred_7 obj_12 obj_06)
       (pred_7 obj_12 obj_09)
       (pred_7 obj_13 obj_20)
       (pred_7 obj_13 obj_11)
       (pred_7 obj_13 obj_02)
       (pred_7 obj_11 obj_04)
       (pred_7 obj_11 obj_18)
       (pred_7 obj_11 obj_07)
       (pred_7 obj_11 obj_13)
       (pred_7 obj_18 obj_03)
       (pred_7 obj_18 obj_06)
       (pred_7 obj_18 obj_09)
       (pred_7 obj_18 obj_11)
       (pred_7 obj_06 obj_10)
       (pred_7 obj_06 obj_12)
       (pred_7 obj_06 obj_18)
       (pred_7 obj_20 obj_17)
       (pred_7 obj_20 obj_04)
       (pred_7 obj_20 obj_13)
       (pred_7 obj_04 obj_16)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_04 obj_11)
       (pred_7 obj_04 obj_20)
       (pred_7 obj_03 obj_14)
       (pred_7 obj_03 obj_10)
       (pred_7 obj_03 obj_18)
       (pred_7 obj_03 obj_04)
       (pred_7 obj_10 obj_08)
       (pred_7 obj_10 obj_06)
       (pred_7 obj_10 obj_03)
       (pred_7 obj_17 obj_16)
       (pred_7 obj_17 obj_20)
       (pred_7 obj_16 obj_14)
       (pred_7 obj_16 obj_04)
       (pred_7 obj_16 obj_17)
       (pred_7 obj_14 obj_08)
       (pred_7 obj_14 obj_03)
       (pred_7 obj_14 obj_16)
       (pred_7 obj_08 obj_10)
       (pred_7 obj_08 obj_14)
       (pred_9 obj_14)
       (pred_9 obj_17)
       (pred_5  obj_14 obj_15)
       (pred_5  obj_17 obj_05)
       (pred_2 obj_02)
       (pred_2 obj_07)
       (pred_2 obj_09)
       (pred_2 obj_12)
       (pred_2 obj_13)
       (pred_2 obj_11)
       (pred_2 obj_18)
       (pred_2 obj_06)
       (pred_2 obj_20)
       (pred_2 obj_04)
       (pred_2 obj_03)
       (pred_2 obj_10)
       (pred_2 obj_16)
       (pred_2 obj_08)

       (pred_12  obj_19 obj_15)
       (pred_12  obj_01 obj_05)
       (pred_1 obj_19 obj_11)
       (pred_1 obj_01 obj_12)
       (pred_8 obj_06)
    )

    (:goal (and
       (pred_1 obj_19 obj_03)
       (pred_1 obj_01 obj_04)
    ))
(:constraints
  (always (not (pred_8 obj_18)))
)
)

; plan
1. (op_2 obj_06 obj_12)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_12)
   goals met: 0 of 2
2. (op_1 obj_12 obj_01)
   deleted: (pred_1 obj_01 obj_12) (pred_4)
   added: (pred_6 obj_01)
   goals met: 0 of 2
3. (op_2 obj_12 obj_09)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_09)
   goals met: 0 of 2
4. (op_2 obj_09 obj_07)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_07)
   goals met: 0 of 2
5. (op_2 obj_07 obj_11)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_11)
   goals met: 0 of 2
6. (op_2 obj_11 obj_04)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_04)
   goals met: 0 of 2
7. (op_4 obj_04 obj_01)
   deleted: (pred_6 obj_01)
   added: (pred_4) (pred_1 obj_01 obj_04)
   goals met: 1 of 2
8. (op_2 obj_04 obj_11)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_11)
   goals met: 1 of 2
9. (op_1 obj_11 obj_19)
   deleted: (pred_1 obj_19 obj_11) (pred_4)
   added: (pred_6 obj_19)
   goals met: 1 of 2
10. (op_2 obj_11 obj_04)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_04)
   goals met: 1 of 2
11. (op_2 obj_04 obj_03)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_03)
   goals met: 1 of 2
12. (op_4 obj_03 obj_19)
   deleted: (pred_6 obj_19)
   added: (pred_4) (pred_1 obj_19 obj_03)
   goals met: 2 of 2
